# BuiltInFailures.ViewSheetFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ViewSheetFailures Class
BuiltInFailures Class Members See Also
---
Failures about placing viewports on sheets.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class ViewSheetFailures
```

Visual Basic
---
```text
Public NotInheritable Class ViewSheetFailures
```

Visual C++
---
```text
public ref class ViewSheetFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..ViewSheetFailures
# See Also
BuiltInFailures..::..ViewSheetFailures Members
Autodesk.Revit.DB Namespace